cc-env/DebianMail.org
#+TITLE: Mail 環境の設定
#+DATE: 2017-02-20 17:57:23
#+LANGUAGE: ja
#+REF: cc-env/DebianMail
#+LAYOUT: cc-env
#+SETUPFILE: ~/Public/_setup.org
#+PERMALINK: /cc-env/DebianMail.html
Related: [[wiki:index][Index]] [[id:591f6b0d-55ff-48eb-b095-401cdfa0d536][Debian]]
* 始めに
  メールに関するアレコレ.
  ネットワーク接続を意識したくないので,
  送受信用のサーバを手元に置いて MUA はなるべくここを叩くようにしている.
* 送信設定: Exim4
  smarthost での送信だけなら Exim4 が軽量で楽。
  他にも幾つか選択肢はある。気になるなら [[https://wiki.debian.org/Debate/DefaultMTA][Debian Wiki: DefaultMTA]] あたり参照のこと。
  欲しい機能は
  - 上流の MTA への smarthost 送信。
  - offline 時の queue
  - localhost:25 での待受
  なので、軽いしとりあえず Exim4 をそのまま使っている。
  #+BEGIN_EXAMPLE
$ sudo -s
# dpkg-reconfigure -plow exim4-config
  メール設定の一般的なタイプ: 2. スマートホストでメール送信; SMTP または fetchmail で受信する
  システムメール名: localhost
  入力側 SMTP 接続をリスンする IP アドレス: 127.0.0.1
  メールを受け取るその他の宛先: [空白]
  メールをリレーするマシン: [空白]
  送出スマートホストの IP アドレスまたはホスト名: スマートホスト用の送信サーバ::587
  送出するメールでローカルメール名を隠しますか? no
  DNS クエリの数を最小限に留めますか (ダイヤルオンデマンド)? no
  ローカルメールの配送方式: 1. /var/mail/ 内の mbox 形式
  設定を小さなファイルに分割しますか?: no
  root と postmaster のメール受信者: 適当に設定
  #+END_EXAMPLE
  そのあと, =/etc/exim4/passwd.client= 内で, スマートホストの設定
  #+BEGIN_SRC conf
スマートホスト送信サーバ:[アカウント]:[パスワード]
  #+END_SRC
  そして必要なら =/etc/exim4/email-addresses= に置換するリストを適当に記述.
  最低限 root と ユーザ宛(uid=1000) のメール送信先は設定しておく.
  #+BEGIN_EXAMPLE
$ sudo -s
# upate-exim4.conf
# sudo /etc/init.d/exim4 restart
  #+END_EXAMPLE
  あとは適当にテストとかしてみると良い.

  (2012/07/30) このままだと message-id が "乱数列@hostname" になるので
  =/etc/exim4/exim4.conf.template= あたりに
  #+BEGIN_SRC conf
message_id_header_domain = ドメイン名
message_id_header_text   = ホスト名
  #+END_SRC
  を追加して =update-exim4.conf= を走らせておくと良い。

  ローカル配送先を適宜設定したい場合には
  #+BEGIN_SRC conf
MAILDIR_HOME_MAILDIR_LOCATION = $home/Maildir/INBOX
  #+END_SRC
* 送信設定: msmtp
  [[id:544e8091-614a-4784-a889-78651a923d6c][Wanderlust]] からメールを送る時には,
  =msmtp= を使っている.

  sendmail コマンド互換かつ enverope-from に応じて送信に利用する
  SMTP サーバを切り替えられる, というのが良い.
  本当は Gmail に SMTP サーバを登録しておいて, exim4 の smarthost で
  Gmail に丸投げしたかったのだけれど,
  Gmail のメールサーバは =Reply-To= を上書きしたりして行儀が良くない.

  msmtp 自体の設定はいたって普通だが, queue が面倒?
  結局 Emacs からは =sendmail= として
#+INCLUDE: "~/bin/nm-msmtp" src sh
  を叩くことで, ネットワーク接続がある場合には即座に送信,
  無い場合には queuing, という風に動作を切り替えている.

  あとは NetworkManager の dispatcher として msmtp-runqueue を走らせれば良い.
* 受信
  受信/閲覧は
  - [[http://isync.sourceforge.net/][isync]] で、リモートの IMAP サーバのメールをローカルに Maildir 形式で保存
  - ローカルで dovecot-imapd を起動してメールを閲覧
  としている.

  最近の MUA は多かれ少なかれ IMAP 接続でも手元にメールを持ってくるので,
  このメールの重複をなんとかしたいのだけれども,
  例えば Wanderlust なんかで Maildir を直接見にいくと Emacs の反応があまり芳しくない.

  以前 [[http://gihyo.jp/admin/serial/01/ubuntu-recipe/0247][第247回 Offlineimap＋Dovecotによる快適メール環境：Ubuntu Weekly Recipe]] なんて記事を書いた。
  その時は offlineimap を使っていたのだけれども
  - 遅い。特に 2014 年あたりから Gmail の同期が体感できるレベルで遅くなった
  - 偶に block するし、imap の接続数が酷い事になる。
  ということで、2015 年から [[http://isync.sourceforge.net/][isync: free IMAP and MailDir mailbox synchronizer]] に移行した。
** mbsync/isync
   isync/mbsync はリモートの IMAP サーバとローカルの Maildir を同期するソフトウェア。
*** インストール
    実行バイナリは =isync= もしくは =mbsync= 。以前の名前が =isync= なので、Debian のパッケージ名はそのままである。
    #+BEGIN_EXAMPLE
$ sudo apt-get install isync
    #+END_EXAMPLE
    apt 万歳
*** 設定
    設定ファイルは =~/.mbsyncrc=.
    設定例は以下:
    - =~/Maildir/= 以下にサーバのメールを同期する
    - =~/Maildir/INBOX.mobile.XXX= に imap.mobile.com のメールを同期.
      - 明示的に =Pattern= を指定することで、指定ディレクトリ以外を同期しないことにする
    - =~/Maildir/INBOX.Gmail.XXX= に Gmail のメールを同期
      - 明示的に =Pattern= を指定することで、指定ディレクトリ以外を同期しないことにする
      - =[Gmail]/= というラベルを上手く扱えないので、同期チャンネルを複数設定することで対応
        - 今のところ SPAM 堕ちしたメールの確認のためだけに =~/Maildir/INBOX.Gmail.Junk= のみ確認している
    - =~/Maildir/INBOX= に =work.example.com= のメールを同期
      - =work.example.com= メールサーバのディレクトリが =work/2014= 等と "/" 区切りになっているので =Flatten: .= で
        =INBOX.work.2014= 等に変換する。そのために =MaildirStore= を複数設定している
      - =Pattern: * !*mobile* !*Gmail*= で同期から除外する =Maildir= を指定する
    - PassCmd で gpg 暗号化した netrc 形式のファイルからパスワードを取得している.
      - これ、User なんかにも使えないかなぁ、とか思ったり
    今のところ特に使用に際して困った事はおきていない。
    #+BEGIN_SRC conf
IMAPAccount mobile
Host mobile.example.com
User TheMobileUserAccount
PassCmd "echo ${PASSWORD:-$(gpg --no-tty -qd ~/.authinfo.gpg | sed -n 's,^machine mobile.example.com .*password \\\([^ ]*\\) port.*,\\1,p')}"
Port 993
UseIMAPS yes
RequireSSL yes
UseTLSv1.2 yes
CertificateFile /etc/ssl/certs/ca-certificates.crt

IMAPAccount work
Host work.example.com
User TheWorkUserAccount
PassCmd "echo ${PASSWORD:-$(gpg --no-tty -qd ~/.authinfo.gpg | sed -n 's,^machine work.example.com .*password \\\([^ ]*\\) port.*,\\1,p')}"
Port 993
UseIMAPS yes
RequireSSL yes
UseTLSv1.2 yes
CertificateFile /etc/ssl/certs/ca-certificates.crt

IMAPAccount gmail
Host imap.gmail.com
User GmailMailAddress
PassCmd "echo ${PASSWORD:-$(gpg --no-tty -qd ~/.authinfo.gpg | sed -n 's,^machine imap.gmail.com .*password \\\([^ ]*\\) port.*,\\1,p')}"
Port 993
UseIMAPS yes
RequireSSL yes
UseTLSv1.2 yes
CertificateFile /etc/ssl/certs/ca-certificates.crt

IMAPStore work-remote
Account work
UseNamespace no

IMAPStore work-remote
Account work

IMAPStore gmail-remote
Account gmail
UseNamespace yes

MaildirStore local
Path ~/Maildir/
Inbox ~/Maildir/INBOX

MaildirStore work-local
Path ~/Maildir/
Inbox ~/Maildir/INBOX
Flatten .

Channel mobile
Master :mobile-remote:
Slave :local:INBOX.mobile.
Patterns INBOX Junk Archives Sent Drafts Trash
Create Both
Expunge Both
Sync all
SyncState *

Channel gmail
Master :gmail-remote:
Slave :local:INBOX.Gmail.
Patterns INBOX
Create Both
Expunge Both
Sync all
SyncState *

Channel gmail-junk
Master ":gmail-remote:[Gmail]/&j,dg0TDhMPww6w-"
Slave :local:INBOX.Gmail.Junk
Patterns *
Create Both
Expunge Both
Sync all
SyncState *

Channel work
Master :work-remote:
Slave :work-local:
Patterns * !*mobile* !*Gmail*
Create Both
Expunge Both
Sync all
SyncState *
    #+END_SRC
    上手く設定できているなら
    #+BEGIN_EXAMPLE
mbsync -l mobile
    #+END_EXAMPLE
    などとして、同期する =Maildir= を確認すると良い。
    リモートとローカルでどういうマッピングがされているかわかるだろう。
    25万通(6.5G)の同期にだいたい 3 時間ぐらい。
    回線速度に依存するだろうけれど、offlineimap より目に見えて速い(気がする)。
    また、IMAP Pipeline で処理されているので、サーバ上の IMAP connection の数は 1 つのみだった。
