cc-env/DebianMail.html
---
title: Mail 環境の設定
date: 2017-02-20 17:57:23
layout: cc-env
lang: ja
ref: cc-env/DebianMail
permalink: /cc-env/DebianMail.html
---
<div id="toc-wrapper">
<nav id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge99516c">始めに</a></li>
<li><a href="#org778b89a">送信設定: Exim4</a></li>
<li><a href="#orgadebf72">送信設定: msmtp</a></li>
<li><a href="#orged459f5">受信</a>
<ul>
<li><a href="#org7abcb25">mbsync/isync</a>
<ul>
<li><a href="#orgabfac31">インストール</a></li>
<li><a href="#org813998b">設定</a></li>
<li><a href="#org5d2d440">cron での動作</a></li>
</ul>
</li>
<li><a href="#org9e83b12">dovecot</a>
<ul>
<li><a href="#org5123ec2">インストール</a></li>
<li><a href="#orga039fb0">設定</a></li>
</ul>
</li>
<li><a href="#org981070b">以下, obsolete</a>
<ul>
<li><a href="#org08c598a">検索: Solr</a></li>
<li><a href="#org445f854">検索: Solr で日本語</a></li>
<li><a href="#org59e01d8">offlineimap</a>
<ul>
<li><a href="#orgdbce8fb">インストール</a></li>
<li><a href="#orgeafc4dd">設定</a></li>
<li><a href="#org9a0907c">cron での動作</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
</div>
<a href="#toc-toggle" class="btn toc-btn" id="toc-toggle">&#30446;&#27425;</a>
<p>
Related: <a href='index.html'>Index</a> <a href="index.html#ID-591f6b0d-55ff-48eb-b095-401cdfa0d536">Debian</a>
</p>
<div id="outline-container-orge99516c" class="outline-2">
<h2 id="orge99516c">始めに</h2>
<div class="outline-text-2" id="text-orge99516c">
<p>
メールに関するアレコレ.
ネットワーク接続を意識したくないので,
送受信用のサーバを手元に置いて MUA はなるべくここを叩くようにしている.
</p>
</div>
</div>
<div id="outline-container-org778b89a" class="outline-2">
<h2 id="org778b89a">送信設定: Exim4</h2>
<div class="outline-text-2" id="text-org778b89a">
<p>
smarthost での送信だけなら Exim4 が軽量で楽。
他にも幾つか選択肢はある。気になるなら <a href="https://wiki.debian.org/Debate/DefaultMTA">Debian Wiki: DefaultMTA</a> あたり参照のこと。
欲しい機能は
</p>
<ul class="org-ul">
<li>上流の MTA への smarthost 送信。</li>
<li>offline 時の queue</li>
<li>localhost:25 での待受</li>
</ul>
<p>
なので、軽いしとりあえず Exim4 をそのまま使っている。
</p>
<pre class="example">
$ sudo -s
# dpkg-reconfigure -plow exim4-config
  メール設定の一般的なタイプ: 2. スマートホストでメール送信; SMTP または fetchmail で受信する
  システムメール名: localhost
  入力側 SMTP 接続をリスンする IP アドレス: 127.0.0.1
  メールを受け取るその他の宛先: [空白]
  メールをリレーするマシン: [空白]
  送出スマートホストの IP アドレスまたはホスト名: スマートホスト用の送信サーバ::587
  送出するメールでローカルメール名を隠しますか? no
  DNS クエリの数を最小限に留めますか (ダイヤルオンデマンド)? no
  ローカルメールの配送方式: 1. /var/mail/ 内の mbox 形式
  設定を小さなファイルに分割しますか?: no
  root と postmaster のメール受信者: 適当に設定
</pre>
<p>
そのあと, <code>/etc/exim4/passwd.client</code> 内で, スマートホストの設定
</p>
<div class="org-src-container">
<pre class="src src-conf">スマートホスト送信サーバ:[アカウント]:[パスワード]
</pre>
</div>
<p>
そして必要なら <code>/etc/exim4/email-addresses</code> に置換するリストを適当に記述.
最低限 root と ユーザ宛(uid=1000) のメール送信先は設定しておく.
</p>
<pre class="example">
$ sudo -s
# upate-exim4.conf
# sudo /etc/init.d/exim4 restart
</pre>
<p>
あとは適当にテストとかしてみると良い.
</p>

<p>
(2012/07/30) このままだと message-id が "乱数列@hostname" になるので
<code>/etc/exim4/exim4.conf.template</code> あたりに
</p>
<div class="org-src-container">
<pre class="src src-conf">message_id_header_domain = ドメイン名
message_id_header_text   = ホスト名
</pre>
</div>
<p>
を追加して <code>update-exim4.conf</code> を走らせておくと良い。
</p>

<p>
ローカル配送先を適宜設定したい場合には
</p>
<div class="org-src-container">
<pre class="src src-conf">MAILDIR_HOME_MAILDIR_LOCATION = $home/Maildir/INBOX
</pre>
</div>
</div>
</div>
<div id="outline-container-orgadebf72" class="outline-2">
<h2 id="orgadebf72">送信設定: msmtp</h2>
<div class="outline-text-2" id="text-orgadebf72">
<p>
<a href="Emacs.html#ID-544e8091-614a-4784-a889-78651a923d6c">Wanderlust</a> からメールを送る時には,
<code>msmtp</code> を使っている.
</p>

<p>
sendmail コマンド互換かつ enverope-from に応じて送信に利用する
SMTP サーバを切り替えられる, というのが良い.
本当は Gmail に SMTP サーバを登録しておいて, exim4 の smarthost で
Gmail に丸投げしたかったのだけれど,
Gmail のメールサーバは <code>Reply-To</code> を上書きしたりして行儀が良くない.
</p>

<p>
msmtp 自体の設定はいたって普通だが, queue が面倒?
結局 Emacs からは <code>sendmail</code> として
</p>
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh
ARGS="$*"
msmtp-enqueue.sh $ARGS 1&gt;/dev/null
`LANG=ja_JP.UTF-8 nmcli dev status | grep -v 管理無し | grep -q 接続済み` &amp;&amp; \
    msmtp-runqueue.sh 2&gt;&amp;1 1&gt;/dev/null
exit 0
</pre>
</div>
<p>
を叩くことで, ネットワーク接続がある場合には即座に送信,
無い場合には queuing, という風に動作を切り替えている.
</p>

<p>
あとは NetworkManager の dispatcher として msmtp-runqueue を走らせれば良い.
</p>
</div>
</div>
<div id="outline-container-orged459f5" class="outline-2">
<h2 id="orged459f5">受信</h2>
<div class="outline-text-2" id="text-orged459f5">
<p>
受信/閲覧は
</p>
<ul class="org-ul">
<li><a href="http://isync.sourceforge.net/">isync</a> で、リモートの IMAP サーバのメールをローカルに Maildir 形式で保存</li>
<li>ローカルで dovecot-imapd を起動してメールを閲覧</li>
</ul>
<p>
としている.
</p>

<p>
最近の MUA は多かれ少なかれ IMAP 接続でも手元にメールを持ってくるので,
このメールの重複をなんとかしたいのだけれども,
例えば Wanderlust なんかで Maildir を直接見にいくと Emacs の反応があまり芳しくない.
</p>

<p>
以前 <a href="http://gihyo.jp/admin/serial/01/ubuntu-recipe/0247">第247回 Offlineimap＋Dovecotによる快適メール環境：Ubuntu Weekly Recipe</a> なんて記事を書いた。
その時は offlineimap を使っていたのだけれども
</p>
<ul class="org-ul">
<li>遅い。特に 2014 年あたりから Gmail の同期が体感できるレベルで遅くなった</li>
<li>偶に block するし、imap の接続数が酷い事になる。</li>
</ul>
<p>
ということで、2015 年から <a href="http://isync.sourceforge.net/">isync: free IMAP and MailDir mailbox synchronizer</a> に移行した。
</p>
</div>
<div id="outline-container-org7abcb25" class="outline-3">
<h3 id="org7abcb25">mbsync/isync</h3>
<div class="outline-text-3" id="text-org7abcb25">
<p>
isync/mbsync はリモートの IMAP サーバとローカルの Maildir を同期するソフトウェア。
</p>
</div>
<div id="outline-container-orgabfac31" class="outline-4">
<h4 id="orgabfac31">インストール</h4>
<div class="outline-text-4" id="text-orgabfac31">
<p>
実行バイナリは <code>isync</code> もしくは <code>mbsync</code> 。以前の名前が <code>isync</code> なので、Debian のパッケージ名はそのままである。
</p>
<pre class="example">
$ sudo apt-get install isync
</pre>
<p>
apt 万歳
</p>
</div>
</div>
<div id="outline-container-org813998b" class="outline-4">
<h4 id="org813998b">設定</h4>
<div class="outline-text-4" id="text-org813998b">
<p>
設定ファイルは <code>~/.mbsyncrc</code>.
設定例は以下:
</p>
<ul class="org-ul">
<li><code>~/Maildir/</code> 以下にサーバのメールを同期する</li>
<li><code>~/Maildir/INBOX.mobile.XXX</code> に imap.mobile.com のメールを同期.
<ul class="org-ul">
<li>明示的に <code>Pattern</code> を指定することで、指定ディレクトリ以外を同期しないことにする</li>
</ul></li>
<li><code>~/Maildir/INBOX.Gmail.XXX</code> に Gmail のメールを同期
<ul class="org-ul">
<li>明示的に <code>Pattern</code> を指定することで、指定ディレクトリ以外を同期しないことにする</li>
<li><code>[Gmail]/</code> というラベルを上手く扱えないので、同期チャンネルを複数設定することで対応
<ul class="org-ul">
<li>今のところ SPAM 堕ちしたメールの確認のためだけに <code>~/Maildir/INBOX.Gmail.Junk</code> のみ確認している</li>
</ul></li>
</ul></li>
<li><code>~/Maildir/INBOX</code> に <code>work.example.com</code> のメールを同期
<ul class="org-ul">
<li><code>work.example.com</code> メールサーバのディレクトリが <code>work/2014</code> 等と "/" 区切りになっているので <code>Flatten: .</code> で
<code>INBOX.work.2014</code> 等に変換する。そのために <code>MaildirStore</code> を複数設定している</li>
<li><code>Pattern: * !*mobile* !*Gmail*</code> で同期から除外する <code>Maildir</code> を指定する</li>
</ul></li>
<li>PassCmd で gpg 暗号化した netrc 形式のファイルからパスワードを取得している.
<ul class="org-ul">
<li>これ、User なんかにも使えないかなぁ、とか思ったり</li>
</ul></li>
</ul>
<p>
今のところ特に使用に際して困った事はおきていない。
</p>
<div class="org-src-container">
<pre class="src src-conf">IMAPAccount mobile
Host mobile.example.com
User TheMobileUserAccount
PassCmd "echo ${PASSWORD:-$(gpg --no-tty -qd ~/.authinfo.gpg | sed -n 's,^machine mobile.example.com .*password \\\([^ ]*\\) port.*,\\1,p')}"
Port 993
UseIMAPS yes
RequireSSL yes
UseTLSv1.2 yes
CertificateFile /etc/ssl/certs/ca-certificates.crt

IMAPAccount work
Host work.example.com
User TheWorkUserAccount
PassCmd "echo ${PASSWORD:-$(gpg --no-tty -qd ~/.authinfo.gpg | sed -n 's,^machine work.example.com .*password \\\([^ ]*\\) port.*,\\1,p')}"
Port 993
UseIMAPS yes
RequireSSL yes
UseTLSv1.2 yes
CertificateFile /etc/ssl/certs/ca-certificates.crt

IMAPAccount gmail
Host imap.gmail.com
User GmailMailAddress
PassCmd "echo ${PASSWORD:-$(gpg --no-tty -qd ~/.authinfo.gpg | sed -n 's,^machine imap.gmail.com .*password \\\([^ ]*\\) port.*,\\1,p')}"
Port 993
UseIMAPS yes
RequireSSL yes
UseTLSv1.2 yes
CertificateFile /etc/ssl/certs/ca-certificates.crt

IMAPStore work-remote
Account work
UseNamespace no

IMAPStore work-remote
Account work

IMAPStore gmail-remote
Account gmail
UseNamespace yes

MaildirStore local
Path ~/Maildir/
Inbox ~/Maildir/INBOX

MaildirStore work-local
Path ~/Maildir/
Inbox ~/Maildir/INBOX
Flatten .

Channel mobile
Master :mobile-remote:
Slave :local:INBOX.mobile.
Patterns INBOX Junk Archives Sent Drafts Trash
Create Both
Expunge Both
Sync all
SyncState *

Channel gmail
Master :gmail-remote:
Slave :local:INBOX.Gmail.
Patterns INBOX
Create Both
Expunge Both
Sync all
SyncState *

Channel gmail-junk
Master ":gmail-remote:[Gmail]/&amp;j,dg0TDhMPww6w-"
Slave :local:INBOX.Gmail.Junk
Patterns *
Create Both
Expunge Both
Sync all
SyncState *

Channel work
Master :work-remote:
Slave :work-local:
Patterns * !*mobile* !*Gmail*
Create Both
Expunge Both
Sync all
SyncState *
</pre>
</div>
<p>
上手く設定できているなら
</p>
<pre class="example">
mbsync -l mobile
</pre>
<p>
などとして、同期する <code>Maildir</code> を確認すると良い。
リモートとローカルでどういうマッピングがされているかわかるだろう。
25万通(6.5G)の同期にだいたい 3 時間ぐらい。
回線速度に依存するだろうけれど、offlineimap より目に見えて速い(気がする)。
また、IMAP Pipeline で処理されているので、サーバ上の IMAP connection の数は 1 つのみだった。
</p>
</div>
</div>
