cc-env/DebianMail.org
*** cron での動作
    認証に GPG を使っており、認証に Gnome Keyring を用いているので
    必要な環境変数を読み込んでから実行するようにする.
    先ず =~/bin/export_x_info.sh= を以下の内容で用意:
    #+BEGIN_SRC sh
#!/bin/bash
sleep 5
# Export the dbus session address on startup so it can be used by cron
touch $HOME/.Xdbus
chmod 600 $HOME/.Xdbus
env | grep DBUS_SESSION_BUS_ADDRESS > $HOME/.Xdbus
env | grep GPG_AGENT_INFO >> $HOME/.Xdbus
echo 'export DBUS_SESSION_BUS_ADDRESS' >> $HOME/.Xdbus
echo 'export GPG_AGENT_INFO' >> $HOME/.Xdbus
    #+END_SRC
    =~/.config/autostart= 以下に適当な名前で
    #+BEGIN_SRC conf
[Desktop Entry]
Type=Application
Exec=/home/uwabami/.mua/export_x_info.sh
Hidden=false
NoDisplay=false
X-GNOME-Autostart-enabled=true
Name=Xdbus infomation exporter
Comment=Xdbus infomation exporter
    #+END_SRC
    を用意しておく.

    あとは cron 実行時に =~/.Xdbus= を include するようにしておけば,
    必要に応じて GnomeKeyring による認証が行なわれる.
    cron で実行されるスクリプトは, 例えば
    #+BEGIN_SRC sh
#!/bin/sh
# -*- mode:sh; coding: utf-8-unix; indent-tabs-mode: nil -*-
################################################################################
# for personal settings
PID=~/Maildir/mbsync.pid
CONF=~/.mbsyncrc
# for gnome-keyring:
. ${HOME}/.Xdbus
# check network is avaliable
nm-online -x  2>/dev/null || exit 0
# check another offlineimap
timelimit -T 300 -t 300 mbsync -c $CONF -a 2>&1 || exit 0
    #+END_SRC
    とか。mbsync 自体の timeout や PID  管理ができないので、 =timelinit= コマンドで処理をするようにしている。
    実際は、二回目以降の同期は(回線速度に依存するだろうけれど) 20 秒ぐらい。
** dovecot
*** インストール
    最低限 IMAP での接続ができれば良いので
    #+BEGIN_EXAMPLE
% sudo apt-get install dovecot-imapd
    #+END_EXAMPLE
    apt 万歳
*** 設定
    最低限の設定として、
    - localhost で起動. 認証は PAM に任せる(login パスワードと同じ)
    - Maildir 形式で mbsync(もしくは offlineimap)で同期したMaildirを読む.
    - IMAP もしくは IMAP over SSL のみ
    ための設定を行なう

    以下、設定ファイル中のコメント行を除いた部分だけを記載しているので注意
    (コメント消すなんてとんでもない!)。

    先ず待受サーバ。
    どの IP アドレスで待ち受けるかは =/etc/dovecot/dovecot.conf= にあるので
    #+BEGIN_SRC conf
...
listen = 127.0.0.1
...
    #+END_SRC
    あたりを修正しておく。

    認証は
    =/etc/dovecot/conf.d/10-auth.conf= 内で
    #+BEGIN_SRC conf
disable_plain_text_auth = no
auth_mechanisms = plain
!include auth-system.conf.ext
    #+END_SRC
    を有効に。include されている auth-system.conf.ext の中身は
    #+BEGIN_SRC conf
passdb {
  driver = pam
}
userdb {
  driver = passwd
}
    #+END_SRC
    だけが有効。これで pam 経由でパスワードログインするようになる.

    次に Maildir の設定。 =/etc/dovecot/conf.d/10-mail.conf= 内で
    #+BEGIN_SRC conf
mail_location = maildir:%h/Maildir:INBOX=%h/Maildir/INBOX:LAYOUT=fs
namespace inbox {
  inbox = yes
}
    #+END_SRC
    あたりを修正しておく。

    最後に IMAP over SSL の設定。 =/etc/dovecot/conf.d/10-ssl.conf= で証明書の設定をする:
    #+BEGIN_SRC conf
ssl_cert = </etc/ssl/private/ssl-cert-dovecot.pem
ssl_key = </etc/ssl/private/ssl-cert-dovecot.key
ssl_protocols = !SSLv2 !SSLv3
    #+END_SRC
    その後に =/etc/dovecot/conf.d/10-master.conf= 内の =imap-login= 部分を修正
    #+BEGIN_SRC conf
service imap-login {
  inet_listener imap {
    port = 0
    ssl = no
  }
  inet_listener imaps {
    port = 993
    ssl = yes
  }
}
    #+END_SRC
    これで再起動すると =/etc/ssl/private= に置いた SSL 証明書を使って =127.0.1.1:993= で IMAP サーバが起動する。Listen を 127.0.0.1 に絞るなら SSL でのアクセスは不要かもしれない。
** 以下, obsolete
   検索は mu (maildir-utils) を使うようになったし,
   メールの同期には mbsync を使うようになったので, 以下は昔のお話.
*** 検索: Solr
    Dovecot には FTS(Full Text Search) 用の plugin が幾つかある。
    ここでは Solr を試してみる

    とりあえず jetty で solar を動かすことに:
    #+BEGIN_EXAMPLE
% sudo aptitude -R solr-jetty dovecot-solr
    #+END_EXAMPLE

    Jetty の起動設定は =/etc/default/jetty8= にあるので
    #+BEGIN_SRC conf
NO_START=0
JETTY_HOST=localhost
JETTY_PORT=8089
    #+END_SRC
    としておく。dovecot 用の scheme.xml は =dovecot-solr= をインストールすると =/usr/share/dovecot/solr-scheme.xml= にインストールされるので、これを =/etc/solr/conf/scheme.xml= にコピー
    #+BEGIN_EXAMPLE
% cd /etc/solr/conf
% sudo cp scheme.xml scheme.xml.bak
% sudo cp /usr/share/dovecot/solr-schemex.ml scheme.xml
    #+END_EXAMPLE
    その後で =/etc/dovecot/conf.d/10-imap.conf= 内の mail_plugins 行に
    #+BEGIN_SRC conf
mail_plugins = fts fts_solr
    #+END_SRC
    を追加しておく。
    IMAP でしか使わないのであれば =20-imap.conf= に指定すれば良いのだが、この場合は =doveadm fts rescan -u USERNAME= ができない。
    最後に =/etc/dovecot/conf.d/90-plugin.conf= で
    #+BEGIN_SRC conf
plugin {
  fts_autoindex = yes
  fts = solr
  fts_solr = break-imap-search url=http://localhost:8089/solr/
}
    #+END_SRC
    としておく。これで jetty8 および dovecot を再起動すると、検索が効く様になる...?
