cc-env/DebianMail.html
<div id="outline-container-org5d2d440" class="outline-4">
<h4 id="org5d2d440">cron での動作</h4>
<div class="outline-text-4" id="text-org5d2d440">
<p>
認証に GPG を使っており、認証に Gnome Keyring を用いているので
必要な環境変数を読み込んでから実行するようにする.
先ず <code>~/bin/export_x_info.sh</code> を以下の内容で用意:
</p>
<div class="org-src-container">
<pre class="src src-sh">#!/bin/bash
sleep 5
# Export the dbus session address on startup so it can be used by cron
touch $HOME/.Xdbus
chmod 600 $HOME/.Xdbus
env | grep DBUS_SESSION_BUS_ADDRESS &gt; $HOME/.Xdbus
env | grep GPG_AGENT_INFO &gt;&gt; $HOME/.Xdbus
echo 'export DBUS_SESSION_BUS_ADDRESS' &gt;&gt; $HOME/.Xdbus
echo 'export GPG_AGENT_INFO' &gt;&gt; $HOME/.Xdbus
</pre>
</div>
<p>
<code>~/.config/autostart</code> 以下に適当な名前で
</p>
<div class="org-src-container">
<pre class="src src-conf">[Desktop Entry]
Type=Application
Exec=/home/uwabami/.mua/export_x_info.sh
Hidden=false
NoDisplay=false
X-GNOME-Autostart-enabled=true
Name=Xdbus infomation exporter
Comment=Xdbus infomation exporter
</pre>
</div>
<p>
を用意しておく.
</p>

<p>
あとは cron 実行時に <code>~/.Xdbus</code> を include するようにしておけば,
必要に応じて GnomeKeyring による認証が行なわれる.
cron で実行されるスクリプトは, 例えば
</p>
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh
# -*- mode:sh; coding: utf-8-unix; indent-tabs-mode: nil -*-
################################################################################
# for personal settings
PID=~/Maildir/mbsync.pid
CONF=~/.mbsyncrc
# for gnome-keyring:
. ${HOME}/.Xdbus
# check network is avaliable
nm-online -x  2&gt;/dev/null || exit 0
# check another offlineimap
timelimit -T 300 -t 300 mbsync -c $CONF -a 2&gt;&amp;1 || exit 0
</pre>
</div>
<p>
とか。mbsync 自体の timeout や PID  管理ができないので、 <code>timelinit</code> コマンドで処理をするようにしている。
実際は、二回目以降の同期は(回線速度に依存するだろうけれど) 20 秒ぐらい。
</p>
</div>
</div>
</div>
<div id="outline-container-org9e83b12" class="outline-3">
<h3 id="org9e83b12">dovecot</h3>
<div class="outline-text-3" id="text-org9e83b12">
</div><div id="outline-container-org5123ec2" class="outline-4">
<h4 id="org5123ec2">インストール</h4>
<div class="outline-text-4" id="text-org5123ec2">
<p>
最低限 IMAP での接続ができれば良いので
</p>
<pre class="example">
% sudo apt-get install dovecot-imapd
</pre>
<p>
apt 万歳
</p>
</div>
</div>
<div id="outline-container-orga039fb0" class="outline-4">
<h4 id="orga039fb0">設定</h4>
<div class="outline-text-4" id="text-orga039fb0">
<p>
最低限の設定として、
</p>
<ul class="org-ul">
<li>localhost で起動. 認証は PAM に任せる(login パスワードと同じ)</li>
<li>Maildir 形式で mbsync(もしくは offlineimap)で同期したMaildirを読む.</li>
<li>IMAP もしくは IMAP over SSL のみ</li>
</ul>
<p>
ための設定を行なう
</p>

<p>
以下、設定ファイル中のコメント行を除いた部分だけを記載しているので注意
(コメント消すなんてとんでもない!)。
</p>

<p>
先ず待受サーバ。
どの IP アドレスで待ち受けるかは <code>/etc/dovecot/dovecot.conf</code> にあるので
</p>
<div class="org-src-container">
<pre class="src src-conf">...
listen = 127.0.0.1
...
</pre>
</div>
<p>
あたりを修正しておく。
</p>

<p>
認証は
<code>/etc/dovecot/conf.d/10-auth.conf</code> 内で
</p>
<div class="org-src-container">
<pre class="src src-conf">disable_plain_text_auth = no
auth_mechanisms = plain
!include auth-system.conf.ext
</pre>
</div>
<p>
を有効に。include されている auth-system.conf.ext の中身は
</p>
<div class="org-src-container">
<pre class="src src-conf">passdb {
  driver = pam
}
userdb {
  driver = passwd
}
</pre>
</div>
<p>
だけが有効。これで pam 経由でパスワードログインするようになる.
</p>

<p>
次に Maildir の設定。 <code>/etc/dovecot/conf.d/10-mail.conf</code> 内で
</p>
<div class="org-src-container">
<pre class="src src-conf">mail_location = maildir:%h/Maildir:INBOX=%h/Maildir/INBOX:LAYOUT=fs
namespace inbox {
  inbox = yes
}
</pre>
</div>
<p>
あたりを修正しておく。
</p>

<p>
最後に IMAP over SSL の設定。 <code>/etc/dovecot/conf.d/10-ssl.conf</code> で証明書の設定をする:
</p>
<div class="org-src-container">
<pre class="src src-conf">ssl_cert = &lt;/etc/ssl/private/ssl-cert-dovecot.pem
ssl_key = &lt;/etc/ssl/private/ssl-cert-dovecot.key
ssl_protocols = !SSLv2 !SSLv3
</pre>
</div>
<p>
その後に <code>/etc/dovecot/conf.d/10-master.conf</code> 内の <code>imap-login</code> 部分を修正
</p>
<div class="org-src-container">
<pre class="src src-conf">service imap-login {
  inet_listener imap {
    port = 0
    ssl = no
  }
  inet_listener imaps {
    port = 993
    ssl = yes
  }
}
</pre>
</div>
<p>
これで再起動すると <code>/etc/ssl/private</code> に置いた SSL 証明書を使って <code>127.0.1.1:993</code> で IMAP サーバが起動する。Listen を 127.0.0.1 に絞るなら SSL でのアクセスは不要かもしれない。
</p>
</div>
</div>
</div>
<div id="outline-container-org981070b" class="outline-3">
<h3 id="org981070b">以下, obsolete</h3>
<div class="outline-text-3" id="text-org981070b">
<p>
検索は mu (maildir-utils) を使うようになったし,
メールの同期には mbsync を使うようになったので, 以下は昔のお話.
</p>
</div>
<div id="outline-container-org08c598a" class="outline-4">
<h4 id="org08c598a">検索: Solr</h4>
<div class="outline-text-4" id="text-org08c598a">
<p>
Dovecot には FTS(Full Text Search) 用の plugin が幾つかある。
ここでは Solr を試してみる
</p>

<p>
とりあえず jetty で solar を動かすことに:
</p>
<pre class="example">
% sudo aptitude -R solr-jetty dovecot-solr
</pre>

<p>
Jetty の起動設定は <code>/etc/default/jetty8</code> にあるので
</p>
<div class="org-src-container">
<pre class="src src-conf">NO_START=0
JETTY_HOST=localhost
JETTY_PORT=8089
</pre>
</div>
<p>
としておく。dovecot 用の scheme.xml は <code>dovecot-solr</code> をインストールすると <code>/usr/share/dovecot/solr-scheme.xml</code> にインストールされるので、これを <code>/etc/solr/conf/scheme.xml</code> にコピー
</p>
<pre class="example">
% cd /etc/solr/conf
% sudo cp scheme.xml scheme.xml.bak
% sudo cp /usr/share/dovecot/solr-schemex.ml scheme.xml
</pre>
<p>
その後で <code>/etc/dovecot/conf.d/10-imap.conf</code> 内の mail<sub>plugins</sub> 行に
</p>
<div class="org-src-container">
<pre class="src src-conf">mail_plugins = fts fts_solr
</pre>
</div>
<p>
を追加しておく。
IMAP でしか使わないのであれば <code>20-imap.conf</code> に指定すれば良いのだが、この場合は <code>doveadm fts rescan -u USERNAME</code> ができない。
最後に <code>/etc/dovecot/conf.d/90-plugin.conf</code> で
</p>
<div class="org-src-container">
<pre class="src src-conf">plugin {
  fts_autoindex = yes
  fts = solr
  fts_solr = break-imap-search url=http://localhost:8089/solr/
}
</pre>
</div>
<p>
としておく。これで jetty8 および dovecot を再起動すると、検索が効く様になる&#x2026;?
</p>
</div>
</div>
