cc-env/DebianMail.html
<div id="outline-container-org445f854" class="outline-4">
<h4 id="org445f854">検索: Solr で日本語</h4>
<div class="outline-text-4" id="text-org445f854">
<p>
<code>scheme.xml</code> の修正が必要。
とりあえず
</p>
<ul class="org-ul">
<li><code>/etc/solr/conf/scheme.xml</code> より <code>text_cjk</code> および <code>text_ja</code> の部分を抜き出して, dovecot の提供していた <code>scheme.xml</code> に追加</li>
<li><code>hdr,body,subject</code> を <code>text_cjk</code> で解析するように</li>
</ul>
<p>
してみた.
</p>

<p>
diff は以下:
</p>
<div class="org-src-container">
<pre class="src src-diff">--- solr-schema.xml 2015-05-10 20:52:33.375358006 +0900
+++ schema.xml  2015-05-10 20:37:37.358195292 +0900
@@ -13,6 +13,62 @@
     &lt;fieldType name="long" class="solr.TrieLongField" /&gt;
     &lt;fieldType name="boolean" class="solr.BoolField" /&gt;

+    &lt;!-- CJK bigram (see text_ja for a Japanese configuration using morphological analysis) --&gt;
+    &lt;fieldType name="text_cjk" class="solr.TextField" positionIncrementGap="100"&gt;
+      &lt;analyzer&gt;
+        &lt;tokenizer class="solr.StandardTokenizerFactory"/&gt;
+        &lt;!-- normalize width before bigram, as e.g. half-width dakuten combine  --&gt;
+        &lt;filter class="solr.CJKWidthFilterFactory"/&gt;
+        &lt;!-- for any non-CJK --&gt;
+        &lt;filter class="solr.LowerCaseFilterFactory"/&gt;
+        &lt;filter class="solr.CJKBigramFilterFactory"/&gt;
+      &lt;/analyzer&gt;
+    &lt;/fieldType&gt;
+    &lt;fieldType name="text_ja" class="solr.TextField" positionIncrementGap="100" autoGeneratePhraseQueries="false"&gt;
+      &lt;analyzer&gt;
+      &lt;!-- Kuromoji Japanese morphological analyzer/tokenizer (JapaneseTokenizer)
+
+           Kuromoji has a search mode (default) that does segmentation useful for search.  A heuristic
+           is used to segment compounds into its parts and the compound itself is kept as synonym.
+
+           Valid values for attribute mode are:
+              normal: regular segmentation
+              search: segmentation useful for search with synonyms compounds (default)
+            extended: same as search mode, but unigrams unknown words (experimental)
+
+           For some applications it might be good to use search mode for indexing and normal mode for
+           queries to reduce recall and prevent parts of compounds from being matched and highlighted.
+           Use &lt;analyzer type="index"&gt; and &lt;analyzer type="query"&gt; for this and mode normal in query.
+
+           Kuromoji also has a convenient user dictionary feature that allows overriding the statistical
+           model with your own entries for segmentation, part-of-speech tags and readings without a need
+           to specify weights.  Notice that user dictionaries have not been subject to extensive testing.
+
+           User dictionary attributes are:
+                     userDictionary: user dictionary filename
+             userDictionaryEncoding: user dictionary encoding (default is UTF-8)
+
+           See lang/userdict_ja.txt for a sample user dictionary file.
+
+           See http://wiki.apache.org/solr/JapaneseLanguageSupport for more on Japanese language support.
+        --&gt;
+        &lt;tokenizer class="solr.JapaneseTokenizerFactory" mode="search"/&gt;
+        &lt;!--&lt;tokenizer class="solr.JapaneseTokenizerFactory" mode="search" userDictionary="lang/userdict_ja.txt"/&gt;--&gt;
+        &lt;!-- Reduces inflected verbs and adjectives to their base/dictionary forms (辞書形) --&gt;
+        &lt;filter class="solr.JapaneseBaseFormFilterFactory"/&gt;
+        &lt;!-- Removes tokens with certain part-of-speech tags --&gt;
+        &lt;filter class="solr.JapanesePartOfSpeechStopFilterFactory" tags="lang/stoptags_ja.txt" enablePositionIncrements="true"/&gt;
+        &lt;!-- Normalizes full-width romaji to half-width and half-width kana to full-width (Unicode NFKC subset) --&gt;
+        &lt;filter class="solr.CJKWidthFilterFactory"/&gt;
+        &lt;!-- Removes common tokens typically not useful for search, but have a negative effect on ranking --&gt;
+        &lt;filter class="solr.StopFilterFactory" ignoreCase="true" words="lang/stopwords_ja.txt" enablePositionIncrements="true" /&gt;
+        &lt;!-- Normalizes common katakana spelling variations by removing any last long sound character (U+30FC) --&gt;
+        &lt;filter class="solr.JapaneseKatakanaStemFilterFactory" minimumLength="4"/&gt;
+        &lt;!-- Lower-cases romaji characters --&gt;
+        &lt;filter class="solr.LowerCaseFilterFactory"/&gt;
+      &lt;/analyzer&gt;
+    &lt;/fieldType&gt;
+
     &lt;fieldType name="text" class="solr.TextField" positionIncrementGap="100"&gt;
       &lt;analyzer type="index"&gt;
         &lt;tokenizer class="solr.StandardTokenizerFactory"/&gt;
@@ -43,14 +99,14 @@
    &lt;field name="box" type="string" indexed="true" stored="true" required="true" /&gt;
    &lt;field name="user" type="string" indexed="true" stored="true" required="true" /&gt;

-   &lt;field name="hdr" type="text" indexed="true" stored="false" /&gt;
-   &lt;field name="body" type="text" indexed="true" stored="false" /&gt;
+   &lt;field name="hdr" type="text_cjk" indexed="true" stored="false" /&gt;
+   &lt;field name="body" type="text_cjk" indexed="true" stored="false" /&gt;

    &lt;field name="from" type="text" indexed="true" stored="false" /&gt;
    &lt;field name="to" type="text" indexed="true" stored="false" /&gt;
    &lt;field name="cc" type="text" indexed="true" stored="false" /&gt;
    &lt;field name="bcc" type="text" indexed="true" stored="false" /&gt;
-   &lt;field name="subject" type="text" indexed="true" stored="false" /&gt;
+   &lt;field name="subject" type="text_cjk" indexed="true" stored="false" /&gt;

    &lt;!-- Used by Solr internally: --&gt;
    &lt;field name="_version_" type="long" indexed="true" stored="true"/&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org59e01d8" class="outline-4">
<h4 id="org59e01d8">offlineimap</h4>
<div class="outline-text-4" id="text-org59e01d8">
<p>
(2015/05/10) 以前使っていた時のメモ。もう使わないけれど、たまに検索でココを見に来ている人がいるみたいなので、残しておくことに。
<a href="http://offlineimap.org/">OfflineIMAP</a> は,ネットワーク上にあるIMAPサーバと手元のMaildir/IMAPサーバの同期を取るためのソフトウェア.
</p>
</div>
<div id="outline-container-orgdbce8fb" class="outline-5">
<h5 id="orgdbce8fb">インストール</h5>
<div class="outline-text-5" id="text-orgdbce8fb">
<p>
apt万歳, ってことで.
</p>
<pre class="example">
$ sudo apt-get install offlineimap
</pre>
</div>
</div>
