cc-env/DebianMail.html
<div id="outline-container-orgeafc4dd" class="outline-5">
<h5 id="orgeafc4dd">設定</h5>
<div class="outline-text-5" id="text-orgeafc4dd">
<p>
現状, 以下の通り:
</p>
<ul class="org-ul">
<li><a href="http://offlineimap.org/">OfflineIMAP</a> のメタ情報は <code>~/Mail/offlineimap</code> 以下に格納</li>
<li>同期するサーバは二箇所:
<ul class="org-ul">
<li>Main サーバのメールは <code>~/Mail/imap</code> 以下に格納.
<ul class="org-ul">
<li>この際, IMAP Namespace である <code>INBOX.</code> を除外して <code>Maildir</code> を作成</li>
<li><code>~/Mail/imap/[Gmail]</code> は同期しない</li>
</ul></li>
<li>Gmail のメールは <code>~/Mail/imap/[Gmail]/</code> 以下に格納</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-conf"># -*- mode: conf; coding: utf-8-unix; indent-tabs-mode: nil -*-
# offlineimaprc
#
# Copyright(C) 2011 Youhei SASAKI All rights reserved.
# $Lastupdate: 2014-07-26 18:25:07$
#
# Author: Youhei SASAKI &lt;uwabami@gfd-dennou.org&gt;
# License: WTFPL
#
# Code:
[general]
# メタデータの格納先
metadata = ~/Mail/offlineimap
# 補助関数が定義されたファイルの置き場所
pythonfile = ~/.mua/offlineimap_utils.py
# 同期するサーバの設定
accounts = Main, Gmail
# 同期するアカウントの数
maxsyncaccounts = 2
# UI の設定. cron で同期する場合には quiet の方が良い
ui = basic
socktimeout = 600
# 高速化(?)
fsync = false

# Gmail 用の設定: ここで設定する名前は accounts に揃える
[Account Gmail]
localrepository = LocalGmail
remoterepository = RemoteGmail
maxsize = 2000000000
status_backend = sqlite
# quick = 1 だとフラグは同期されない
# '[Gmail]/全てのメール' を同期するなら quick = 1 の方が良い?
quick = 0

[Repository LocalGmail]
# Gmail の手元の設定
type = Maildir
# Maildir の格納場所
localfolders = ~/Mail/imap/[Gmail]
restoreatime = no
# IMAP のセパレータの変換: Mailbox の "." が "/" となり,
# ディレクトリが作成される
sep = /

[Repository RemoteGmail]
# Gmail との接続設定: type = IMAP でも良い?
type = Gmail
# remote{pass,user}eval は offlineimap_utils.py で定義した関数
remoteusereval = get_username("imap.gmail.com")
remotepasseval = get_password("imap.gmail.com")
maxsize = 2000000000
realdelete = no
# 同時接続数. 並列実行可能なので適宜
# サーバに怒られない程度に
maxconnections = 5
# remote -&gt; local 時のフォルダ名変換(正規表現)
nametrans = lambda foldername: re.sub('^INBOX','', (re.sub('^\[Gmail\]/','', foldername)))
# 同期するフォルダの設定: Gmail 側で IMAP で表示するラベル設定しておく, でも良いかも.
folderfilter = lambda foldername: foldername in [
             'INBOX',                   # -&gt; '~/Mail/imap/[Gmail]' になる
             '[Gmail]/&amp;j,dg0TDhMPww6w-' # -&gt; '~/Mail/imap/[Gmail]/&amp;j,dg0TDhMPww6w-' になる
             ]
sslcacertfile = /etc/ssl/certs/ca-certificates.crt

# Main サーバの設定: ここで設定する名前は [general] accounts に揃える
[Account Main]
localrepository = LocalMain
remoterepository = RemoteMain
status_backend = sqlite
maxsize = 2000000000
quick = 0

[Repository LocalMain]
# 手元の設定
type = Maildir
# Maildir の格納場所
localfolders = ~/Mail/imap
restoreatime = no
# local -&gt; remote での名前変換
# LocaltoRemoteTransnameINBOX は offlineimap_utils.py で定義した関数
nametrans = LocalToRemoteTransnameINBOX
# 'Maildir/imap/[Gmail]' は同期しない
folderfilter = lambda folder: not folder.startswith('[Gmail]')
sep = /

[Repository RemoteMain]
type = IMAP
ssl = yes
# certificates がデフォルトで探せない?
sslcacertfile = /etc/ssl/certs/ca-certificates.crt
remotehost = [main server]
# remote{pass,user}eval は offlineimap_utils.py で定義した関数
remoteusereval = get_username("[main server]")
remotepasseval = get_password("[main server]")
maxsize = 2000000000
maxconnections = 5
# remote -&gt; local での名前の変換
# RemotetoLocalTransnameINBOX は offlineimap_utils.py で定義した関数
nametrans = RemoteToLocalTransnameINBOX
# 同期 *しない* フォルダの選択
folderfilter = lambda foldername: foldername not in [
            'INBOX.Drafts',
            'INBOX.Trash',
            'INBOX.archive.zz2006',
            'INBOX.archive.zz2007',
            'INBOX.archive.zz2008',
            'INBOX.archive.zz2009',
            'INBOX.archive.zz2010',
            'INBOX.archive.zz2011',
            'INBOX.archive.zz2012',
            'INBOX.archive.zz2013'
            ]
</pre>
</div>
<p>
<code>offlineimap_utils.py</code> の中身は以下の通り:
</p>
<div class="org-src-container">
<pre class="src src-python">#!/usr/bin/python
# -*- coding: utf-8
import sys
import re
import os
# # Auth via GnomeKeyring
import gtk
from getpass import getpass
import gnomekeyring as gkey
# Ad hoc fix for Striptime behavior
import locale
locale.setlocale(locale.LC_TIME, 'C')

##################
# Gnome keyring  #
##################

class Keyring(object):
    def __init__(self, name, server, protocol):
        self._name = name
        self._server = server
        self._protocol = protocol
        self._keyring = gkey.get_default_keyring_sync()

    def has_credentials(self):
        try:
            attrs = {"server": self._server, "protocol": self._protocol}
            items = gkey.find_items_sync(gkey.ITEM_NETWORK_PASSWORD, attrs)
            return len(items) &gt; 0
        except gkey.DeniedError:
            return False

    def get_credentials(self):
        attrs = {"server": self._server, "protocol": self._protocol}
        items = gkey.find_items_sync(gkey.ITEM_NETWORK_PASSWORD, attrs)
        return (items[0].attributes["user"], items[0].secret)

    def set_credentials(self, (user, pw)):
        attrs = {
                "user": user,
                "server": self._server,
                "protocol": self._protocol,
            }
        gkey.item_create_sync(gkey.get_default_keyring_sync(),
                gkey.ITEM_NETWORK_PASSWORD, self._name, attrs, pw, True)

def get_username(server):
    keyring = Keyring("offlineimap", server, "imap")
    (username, password) = keyring.get_credentials()
    return username

def get_password(server):
    keyring = Keyring("offlineimap", server, "imap")
    (username, password) = keyring.get_credentials()
    return password

if __name__ == '__main__':
        server = raw_input("server: ")
        user = raw_input("username: ")
        password = getpass("password: ")
        confirm = getpass("confirm password: ")
        if password != confirm:
            print "password doesn't match confirmation!"
            sys.exit(1)
        keyring = Keyring("offlineimap", server, "imap")
        keyring.set_credentials((user, password))

############################
# NameTrans 'INBOX' suffix #
############################
# add 'INBOX' suffix
def LocalToRemoteTransnameINBOX(foldername):
    if (foldername == ""):
        retval = "INBOX"
    else:
        retval = "INBOX." + foldername
    return retval

# remove 'INBOX' suffix
def RemoteToLocalTransnameINBOX(foldername):
    if (foldername == "INBOX"):
        retval = ""
    else:
        retval = re.sub("^INBOX\.", "", foldername)
    return retval
</pre>
</div>
<p>
IMAP の名前空間が複雑な(?)場合には, 適宜正規表現を追加すると良い.
</p>
</div>
</div>
