cc-env/DebianMail.org
**** cron での動作
     認証に GnomeKeyring を使っているので =DBUS_SESSION_BUS_ADDRESS= を設定してから
     実行するようにする.
     先ず =~/bin/export_x_info.sh= を以下の内容で用意
     #+BEGIN_SRC sh
#!/bin/bash
sleep 5
# Export the dbus session address on startup so it can be used by cron
touch $HOME/.Xdbus
chmod 600 $HOME/.Xdbus
env | grep DBUS_SESSION_BUS_ADDRESS > $HOME/.Xdbus
echo 'export DBUS_SESSION_BUS_ADDRESS' >> $HOME/.Xdbus
     #+END_SRC
     =~/.config/autostart= 以下に適当な名前で
     #+BEGIN_SRC conf
[Desktop Entry]
Type=Application
Exec=/home/uwabami/.mua/export_x_info.sh
Hidden=false
NoDisplay=false
X-GNOME-Autostart-enabled=true
Name=Xdbus infomation exporter
Comment=Xdbus infomation exporter
     #+END_SRC
     を用意しておく.

     あとは cron 実行時に =~/.Xdbus= を include するようにしておけば,
     必要に応じて GnomeKeyring による認証が行なわれる.
     cron で実行されるスクリプトは, 例えば
     #+BEGIN_SRC sh
#!/bin/sh
# -*- mode:sh; coding: utf-8-unix; indent-tabs-mode: nil -*-
# $Lastupdate: 2014-07-15 11:52:22$
# Author: Youhei SASAKI <uwabami@gfd-dennou.org>
# License: WTFPL
################################################################################
# for personal settings
OFFLINEIMAP_PID=~/Mail/offlineimap/pid
OFFLINEIMAP_CONF=~/.offlineimaprc
UI=quiet
echo "******************************************************************"
echo `LANG=C date`
echo "******************************************************************"
# for gnome-keyring:
. ${HOME}/.Xdbus
# check network is avaliable
nm-online -x || exit 0
# check another offlineimap
[ $(ps -p `cat $OFFLINEIMAP_PID` -o pid --no-heading) ] \
  || nice -n 19 offlineimap -c $OFFLINEIMAP_CONF -u $UI -o  2>&1
     #+END_SRC
     とか.
