cc-env/DebianMail.html
<div id="outline-container-org9a0907c" class="outline-5">
<h5 id="org9a0907c">cron での動作</h5>
<div class="outline-text-5" id="text-org9a0907c">
<p>
認証に GnomeKeyring を使っているので <code>DBUS_SESSION_BUS_ADDRESS</code> を設定してから
実行するようにする.
先ず <code>~/bin/export_x_info.sh</code> を以下の内容で用意
</p>
<div class="org-src-container">
<pre class="src src-sh">#!/bin/bash
sleep 5
# Export the dbus session address on startup so it can be used by cron
touch $HOME/.Xdbus
chmod 600 $HOME/.Xdbus
env | grep DBUS_SESSION_BUS_ADDRESS &gt; $HOME/.Xdbus
echo 'export DBUS_SESSION_BUS_ADDRESS' &gt;&gt; $HOME/.Xdbus
</pre>
</div>
<p>
<code>~/.config/autostart</code> 以下に適当な名前で
</p>
<div class="org-src-container">
<pre class="src src-conf">[Desktop Entry]
Type=Application
Exec=/home/uwabami/.mua/export_x_info.sh
Hidden=false
NoDisplay=false
X-GNOME-Autostart-enabled=true
Name=Xdbus infomation exporter
Comment=Xdbus infomation exporter
</pre>
</div>
<p>
を用意しておく.
</p>

<p>
あとは cron 実行時に <code>~/.Xdbus</code> を include するようにしておけば,
必要に応じて GnomeKeyring による認証が行なわれる.
cron で実行されるスクリプトは, 例えば
</p>
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh
# -*- mode:sh; coding: utf-8-unix; indent-tabs-mode: nil -*-
# $Lastupdate: 2014-07-15 11:52:22$
# Author: Youhei SASAKI &lt;uwabami@gfd-dennou.org&gt;
# License: WTFPL
################################################################################
# for personal settings
OFFLINEIMAP_PID=~/Mail/offlineimap/pid
OFFLINEIMAP_CONF=~/.offlineimaprc
UI=quiet
echo "******************************************************************"
echo `LANG=C date`
echo "******************************************************************"
# for gnome-keyring:
. ${HOME}/.Xdbus
# check network is avaliable
nm-online -x || exit 0
# check another offlineimap
[ $(ps -p `cat $OFFLINEIMAP_PID` -o pid --no-heading) ] \
  || nice -n 19 offlineimap -c $OFFLINEIMAP_CONF -u $UI -o  2&gt;&amp;1
</pre>
</div>
<p>
とか.
</p>
</div>
</div>
</div>
</div>
</div>
